<?php
// +----------------------------------------------------------------------
// | Description: 基础框架路由配置文件
// +----------------------------------------------------------------------
// | Author: linchuangbin <linchuangbin@honghaiweb.com>
// +----------------------------------------------------------------------
$routerConfig =  [
    // 定义资源路由
    // '__rest__'=>[
    //     'api/index'        =>'api/index',
    //     'api/export'           =>'api/export',
    // ],
];

return $routerConfig;